<?php

use App\ChatUser;
use Illuminate\Database\Seeder;

class Birthdays11ASeeder extends Seeder
{
    protected $birthdays = [
        'Суворов А. 6/01',
        'Русин А. 17/01',
        'Мотова А. 28/01',
        'Горовец В. 16/02',
        'Гомонова Е. 01/03',
        'Никонорова И. 06/03',
        'Ромашкевич О. 25/03',
        'Егорова А. 02/04',
        'Науменко А. 07/04',
        'Серебро Е. 09/04',
        'Козинцева Н. 20/04',
        'Журавкин А. 23/04',
        'Танхельсон Т. 01/05',
        'Вяжевич Н.А. 02/05',
        'Набебин Д. 06/05',
        'Доброцкая Н.Г. 10/05',
        'Лапинская А. 16/05',
        'Калиновский П. 15/06',
        'Старосельский Ю. 30/06',
        'Махаринская А. 08/07',
        'Косенков П. 13/07',
        'Оршанская З. 24/07',
        'Шутова О. 02/08',
        'Клименок Р. 18/08',
        'Шешуков Е. 13/09',
        'Шенделова Ю. 26/09',
        'Расторгуев Д. 04/10',
        'Моргович Е. 08/10',
        'Овсянко Е. 25/10',
        'Мазуров Д. 25/10',
        'Якубец Н. 29/10',
        'Вяжевич И. 15/11',
        'Войтехович А. 17/11',
        'Болдырев В. 28/11'
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $chatUsers = ChatUser::where('eleven_a', true)
            ->get();

        $chatUsers->each->addBirthdays($this->birthdays);
    }
}
